wiki/2016-07-27-linux-make-install-bundle.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>Linux 自解压安装文件</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">Linux 自解压安装文件</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#linux"><div class="category">linux</div></a> </div>
<div class="char-counter">2016-07-27</div>
        <div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7fa1380">1）需要的预安装软件</a></li>
<li><a href="#orgfa8e7f8">2）发布文件的目录结构</a></li>
<li><a href="#org2780f29">3）制作自解压安装文件的bash脚本</a>
<ul>
<li><a href="#orge75f41e">3.1）build</a></li>
<li><a href="#org3eb2075">3.2）decompress</a></li>
<li><a href="#orga0bd058">3.3）install</a></li>
</ul>
</li>
<li><a href="#org50425ab">4）运行build，产生distirbute.bin，发布之</a></li>
<li><a href="#org77b2f9e">同类产品</a></li>
</ul>
</div>
</nav>
<p>
这篇博文讲的是一个自解压安装文件的制作过程，主要参考
<a href="http://www.linuxjournal.com/node/1005818">http://www.linuxjournal.com/node/1005818</a>。
</p>

<div id="outline-container-org7fa1380" class="outline-2">
<h2 id="org7fa1380"><a href="#orgd68a9cf">1</a>）需要的预安装软件</h2>
<div class="outline-text-2" id="text-org7fa1380">
<pre class="example">
bash, cat, gzip, tar, tail。一般Linux系统都安装了这些极其常用的软件工具。

</pre>
</div>
</div>

<div id="outline-container-orgfa8e7f8" class="outline-2">
<h2 id="orgfa8e7f8"><a href="#orgc917053">2</a>）发布文件的目录结构</h2>
<div class="outline-text-2" id="text-orgfa8e7f8">
<p>
例如，假设你的需要安装的文件全部位于release下，当然release下还可以有很多子目录，
如下图所示。
</p>
<p class="verse">
projects/ ------ release/-------  bin/<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;|                   |---- doc/<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;|                   |---- lib/<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;|                   \---- ReadMe<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;|--- install                                                                            <a id="orgd68a9cf">1</a><br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;|--- decompress                                                                    <a id="orgc917053">2</a><br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;|--- build<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;|--- release_tmp/release.tar    （中间产生的临时文件）                    <a id="orge6483ec">3</a><br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;\--- distribute.bin （最终发布文件）                                             <a id="orgfc9621d">1&amp;2&amp;3</a><br>
<br>
</p>

<p>
最终的发布文件为distribute.bin，它其实是由三个文件构成，即安装脚本install，发布
文件档案 release.tar，以及自解压脚本decompress。build脚本只是我们建立这个自解压
安装文件的工具，如上图所示。
</p>
</div>
</div>

<div id="outline-container-org2780f29" class="outline-2">
<h2 id="org2780f29"><a href="#orge6483ec">3</a>）制作自解压安装文件的bash脚本</h2>
<div class="outline-text-2" id="text-org2780f29">
<p>
我们需要写三个bash脚本，build，decompress，install ，如上图所示
</p>
</div>
<div id="outline-container-orge75f41e" class="outline-3">
<h3 id="orge75f41e"><a href="#orge6483ec">3</a>.1）build</h3>
<div class="outline-text-3" id="text-orge75f41e">
<div class="org-src-container">
<pre class="src src-sh"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span>
mkdir release_tmp
<span style="font-weight: bold;">cd</span> release
tar -cf ../release_tmp/release.tar ./*
<span style="font-weight: bold;">cd</span> ../release_tmp
cp ../install ./
tar -czf ../release_install.tar.gz ./*
<span style="font-weight: bold;">cd</span> ../
rm -rf release_tmp
<span style="font-weight: bold;">if</span> [ ! -f release_install.tar.gz ]; <span style="font-weight: bold;">then</span>
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"distributed archieve does not exist"</span>
  <span style="font-weight: bold;">exit</span> 1
<span style="font-weight: bold;">fi</span>
<span style="font-weight: bold;">if</span> [ ! -f decompress ]; <span style="font-weight: bold;">then</span>
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"decompress does not exist"</span>
  <span style="font-weight: bold;">exit</span> 1
<span style="font-weight: bold;">fi</span>
cat decompress release_install.tar.gz &gt; distribute.bin
rm release_install.tar.gz
<span style="font-weight: bold;">if</span> [ -f distribute.bin ]; <span style="font-weight: bold;">then</span>
  chmod +x distribute.bin
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"distribute.bin created"</span>
<span style="font-weight: bold;">else</span>
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"distribute binary does not exist"</span>
<span style="font-weight: bold;">fi</span>

</pre>
</div>

<p>
这个脚本的功能相当简单，除了做一些简单的文件存在性测试外，它的主要功能就是
</p>
<ul class="org-ul">
<li><a href="#orgd68a9cf">1</a>）archive所要发布的文件，即release目录下的文件，得到release.tar；</li>
<li><a href="#orgc917053">2</a>）将release.tar和install脚本压缩为一个压缩档案文件，即 release_install.tar.gz；</li>
<li><a href="#orge6483ec">3</a>）将这个压缩档案文件release_install.tar.gz附加在decompress脚本后面，成为一个
新的文件distribute.bin</li>
</ul>
</div>
</div>

<div id="outline-container-org3eb2075" class="outline-3">
<h3 id="org3eb2075"><a href="#orge6483ec">3</a>.2）decompress</h3>
<div class="outline-text-3" id="text-org3eb2075">
<div class="org-src-container">
<pre class="src src-sh"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span>
<span style="font-weight: bold; font-style: italic;">INSTDIR</span>=/default/install/path/
<span style="font-weight: bold;">if</span> [ $<span style="font-weight: bold; font-style: italic;">#</span> -gt 0 ];<span style="font-weight: bold;">then</span>
   <span style="font-weight: bold; font-style: italic;">INSTDIR</span>=$<span style="font-weight: bold; font-style: italic;">1</span>
   <span style="font-weight: bold;">if</span> [ <span style="font-style: italic;">"${INSTDIR:0:1}"</span> != <span style="font-style: italic;">"/"</span> ];<span style="font-weight: bold;">then</span>
       <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"You must assign an absolute directory to install!"</span>
       <span style="font-weight: bold;">exit</span> 1
   <span style="font-weight: bold;">fi</span>
<span style="font-weight: bold;">fi</span>

<span style="font-weight: bold;">export</span> <span style="font-weight: bold; font-style: italic;">TMPDIR</span>=<span style="font-weight: bold;">`mktemp -d /tmp/myinstaller.XXXXXX`</span>
<span style="font-weight: bold; font-style: italic;">ARCHIVE</span>=<span style="font-weight: bold;">`awk '/^__ARCHIVE_BELOW__/ {print NR + 1; exit 0; }' $0`</span>
tail -n+$<span style="font-weight: bold; font-style: italic;">ARCHIVE</span> $<span style="font-weight: bold; font-style: italic;">0</span> | tar xzv -C $<span style="font-weight: bold; font-style: italic;">TMPDIR</span>
<span style="font-weight: bold; font-style: italic;">CDIR</span>=<span style="font-weight: bold;">`pwd`</span>
<span style="font-weight: bold;">cd</span> $<span style="font-weight: bold; font-style: italic;">TMPDIR</span>
./install $<span style="font-weight: bold; font-style: italic;">INSTDIR</span>
<span style="font-weight: bold;">cd</span> $<span style="font-weight: bold; font-style: italic;">CDIR</span>
rm -rf $<span style="font-weight: bold; font-style: italic;">TMPDIR</span>
<span style="font-weight: bold;">exit</span> 0

__ARCHIVE_BELOW__

</pre>
</div>

<p>
这个脚本主要有两个功能，
</p>
<ul class="org-ul">
<li><a href="#orgd68a9cf">1</a>）检查安装路径，是否为绝对路径，</li>
<li><a href="#orgc917053">2</a>）将distribute.bin后面的部分（其实就是 release_install.tar.gz，它与decompress
脚本内容由分隔符号__ARCHIVE_BELOW__分开）解压缩到一个临时文件夹中，并在此临时
文件夹中运行install脚本。</li>
</ul>

<p>
注意__ARCHIVE_BELOW__后面不要有空行。
</p>
</div>
</div>

<div id="outline-container-orga0bd058" class="outline-3">
<h3 id="orga0bd058"><a href="#orge6483ec">3</a>.3）install</h3>
<div class="outline-text-3" id="text-orga0bd058">
<div class="org-src-container">
<pre class="src src-sh"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span>
[ -d $<span style="font-weight: bold; font-style: italic;">1</span>] || mkdir -p $<span style="font-weight: bold; font-style: italic;">1</span>
tar -C $<span style="font-weight: bold; font-style: italic;">1</span> -xf release.tar
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">other stuff, like set env etc</span>
<span style="font-weight: bold; font-style: italic;">#</span>
</pre>
</div>

<p>
这个脚本的主要功能就是解开档案文件release.tar。当然，一般安装过程，可能还需要其
他的操作，如环境变量的设置，一些系统配置的修改，都可以在这里进行。
</p>

<p>
这里有个问题。如果创建安装目录失败（通常是权限不够），安装脚本并没有清理
decompress脚本（也就是 distribute.bin）产生的临时文件夹。
</p>
</div>
</div>
</div>

<div id="outline-container-org50425ab" class="outline-2">
<h2 id="org50425ab">4）运行build，产生distirbute.bin，发布之</h2>
<div class="outline-text-2" id="text-org50425ab">
<p>
顾客只需要运行distribute.bin即可安装我们的软件。
</p>
</div>
</div>

<div id="outline-container-org77b2f9e" class="outline-2">
<h2 id="org77b2f9e">同类产品</h2>
<div class="outline-text-2" id="text-org77b2f9e">
<p>
makeself
</p>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
